Catalogs/ФункцииКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ФункцииКонвертацииСвойств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВх</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ОбщиеСвойстваГосуслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоНазначение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартныеФункции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтандартныеФункцииКонвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОбщиеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеСведения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбщиеСвойстваГосуслуги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ОбщиеСвойстваГосуслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтандартныеФункцииКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтандартныеФункцииКонвертации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перенести</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвояКонвертация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЧисло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВДату</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФункцииКонвертацииСвойств/Ext/ManagerModule.bsl
#Область ПользовательскиеФункции

Функция ЗначениеСвойства(Настройка) Экспорт

	Свойство = Настройка.Свойство;
	Контрагент = Настройка.ОбъектВх;
	
	Возврат ПланыВидовХарактеристик.ОбщиеСвойстваГосуслуги.ЗначениеСвойства(Свойство, Контрагент);

КонецФункции // ()

Функция ЗначениеСвойстваВЧисло(Настройка) Экспорт

	Значение = ЗначениеСвойства(Настройка);
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Возврат КонвертироватьСтрокуВТип(Значение, ОписаниеТипа);

КонецФункции // (

Функция ЗначениеСвойстваВДату(Настройка) Экспорт

	Значение = ЗначениеСвойства(Настройка);
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Возврат КонвертироватьСтрокуВТип(Значение, ОписаниеТипа);

КонецФункции

Функция ТекущееЗначение(Настройка) Экспорт

	Свойство = Настройка.СвойствоНазначение;
	Контрагент = Настройка.ОбъектВх;
	
	Возврат ОбъектыСервер.ПолучитьЗначениеСвойства(Контрагент, Свойство.Код);

КонецФункции // (




#КонецОбласти

#Область ТехническийИнтерфейс

Процедура ПеренестиЗначения() Экспорт

	НоваяДата = ТекущаяДата();
	ДатаПоследнегоОбновления = Константы.ДатаПоследнегоОбновленияРеквизитовПоГосуслугам.Получить();
	Контрагенты = КонтрагентыСАктуальнымиОбновлениями(ДатаПоследнегоОбновления);
	
	Настройки = АктуальныеДанныеНастроек();
	
	НачатьТранзакцию();
	
	Попытка
	
		Для каждого Контрагент Из Контрагенты Цикл
		
			ПеренестиЗначенияПоКонтрагенту(Контрагент, Настройки);
		
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	Константы.ДатаПоследнегоОбновленияРеквизитовПоГосуслугам.Установить(НоваяДата);

КонецПроцедуры

Функция ВычислитьФункциюПоТипу(Настройка) Экспорт

	Варианты = Перечисления.СтандартныеФункцииКонвертации;
	ТипНастройки = Настройка.СтандартныеФункции;
	Если ТипНастройки = Варианты.Перенести Тогда
	
		Возврат ЗначениеСвойства(Настройка);
	
	ИначеЕсли ТипНастройки = Варианты.ВЧисло Тогда
	
		Возврат ЗначениеСвойстваВЧисло(Настройка);
	
	ИначеЕсли ТипНастройки = Варианты.ВДату Тогда
	
		Возврат ЗначениеСвойстваВДату(Настройка);
	
	ИначеЕсли ТипНастройки = Варианты.СвояКонвертация Тогда
	
		Возврат ВычислитьПользовательскуюФункцию(Настройка);
	
	Иначе
	
		ВызватьИсключение УправленияСообщениями.ПредупреждениеОшибкаСистемы("Нет такой функции");
	
	КонецЕсли;

КонецФункции // ()

Функция ПолучитьДанныеНастройки(Настройка, Менеджер, ОбъектВх = Неопределено) Экспорт

	ДанныеНастройки = Новый Структура;
	ДанныеНастройки.Вставить("Менеджер", Менеджер);
	ДанныеНастройки.Вставить("ОбъектВх", ОбъектВх);
	ДанныеНастройки.Вставить("Свойство", Настройка.Свойство);
	ДанныеНастройки.Вставить("СвойствоНазначение", Настройка.СвойствоНазначение);
	
	ВызовВТестовомРежиме = ?(ЗначениеЗаполнено(ОбъектВх), Истина, Ложь);
	ТекстФункции = ?(ВызовВТестовомРежиме, Настройка.Функция, ПреобразоватьВБоевойВызов(Настройка.Функция));
	ДанныеНастройки.Вставить("Функция", ТекстФункции);
	ДанныеНастройки.Вставить("СтандартныеФункции", Настройка.СтандартныеФункции);
	
	Возврат ДанныеНастройки;

КонецФункции // ()

#КонецОбласти

#Область Техническая

Функция КонвертироватьСтрокуВТип(Значение, ОписаниеТипа)

	Возврат ОписаниеТипа.ПривестиЗначение(Значение);

КонецФункции // ()
// Менеджер и Объект снова
Функция ВычислитьПользовательскуюФункцию(Настройка)
	
	Запрос = Настройка.Функция;
	ОбъектВх = Настройка.ОбъектВх;
	Свойство = Настройка.Свойство;
	СвойствоНазначение = Настройка.СвойствоНазначение;
	Менеджер = Настройка.Менеджер;
	
	Возврат ВычислитьФункцию(Настройка, Менеджер, ОбъектВх, Свойство, СвойствоНазначение, Запрос);

КонецФункции

Функция ВычислитьФункцию(Настройка,
						Знач Менеджер,
						Знач ОбъектВх,
						Знач Свойство,
						Знач СвойствоНазначение,
						Знач Запрос)

	Значение = Неопределено;
	Попытка
		Выполнить(Запрос);
	Исключение
		ВызватьИсключение УправленияСообщениями.ПредупреждениеОбПользовательскойОшибке(
			"Ошибка в выполнении функции: " + ОписаниеОшибки()
		);
	КонецПопытки;
	
	Возврат Значение;

КонецФункции // ()


Функция АктуальныеДанныеНастроек()

	АктуальныеНастройки = АктуальныеНастройки();
	
	Настройки = Новый Массив;
	Для каждого Настройка Из АктуальныеНастройки Цикл
	
		ДанныеНастройки = ПолучитьДанныеНастройки(
			Настройка,
			Справочники.ФункцииКонвертацииСвойств
		);
		
		Настройки.Добавить(ДанныеНастройки);
	
	КонецЦикла;
	
	Возврат Настройки;

КонецФункции // ()




#Область ВспомогательныйФормированиеНастроек

Функция ПреобразоватьВБоевойВызов(Знач Запрос)

	Запрос = СтрЗаменить(Запрос, "Менеджер.ЗначениеСвойства()",       "Менеджер.ЗначениеСвойства(Настройка)");
	Запрос = СтрЗаменить(Запрос, "Менеджер.ЗначениеСвойстваВЧисло()", "Менеджер.ЗначениеСвойстваВЧисло(Настройка)");
	Запрос = СтрЗаменить(Запрос, "Менеджер.ЗначениеСвойстваВДату()",  "Менеджер.ЗначениеСвойстваВДату(Настройка)");
	Запрос = СтрЗаменить(Запрос, "Менеджер.ТекущееЗначение()",        "Менеджер.ТекущееЗначение(Настройка)");
	
	Возврат Запрос;

КонецФункции // ()


#КонецОбласти

Функция АктуальныеНастройки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФункцииКонвертацииСвойств.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФункцииКонвертацииСвойств КАК ФункцииКонвертацииСвойств
		|ГДЕ
		|	ФункцииКонвертацииСвойств.ПометкаУдаления = ЛОЖЬ
		|	И ФункцииКонвертацииСвойств.Используется = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Процедура ПеренестиЗначенияПоКонтрагенту(Контрагент, Настройки)

	НовыеЗначения = Новый Соответствие;
	
	Отчет = Новый Массив;
	Для каждого Настройка Из Настройки Цикл
	
		Настройка["ОбъектВх"] = Контрагент;
		Попытка
		
			Значение = ВычислитьФункциюПоТипу(Настройка);
		
		Исключение
			Отчет.Добавить("Не удалось рассчитать значение: " + ОписаниеОшибки());
		КонецПопытки;
		
		СвойствоНазначение = Настройка.СвойствоНазначение;
		НовыеЗначения.Вставить(СвойствоНазначение, Значение);
	
	КонецЦикла;
	
	Если Отчет.Количество() > 0 Тогда
	
		ЗаписьЖурналаРегистрации(
			"Ошибка переноса данных из Госуслуг",
			УровеньЖурналаРегистрации.Ошибка,
			,
			Контрагент,
			СтрСоединить(Отчет, Символы.ПС)
		);
		Возврат;
	
	КонецЕсли;
	
	Для каждого НовоеЗначение Из НовыеЗначения Цикл
	
		ОбъектыСервер.ЗаписатьЗначениеСвойства(
			Контрагент,
			НовоеЗначение.Ключ.Код,
			НовоеЗначение.Значение
		);
	
	КонецЦикла;

КонецПроцедуры

Функция КонтрагентыСАктуальнымиОбновлениями(ДатаПоследнегоОбновления)

	Возврат РегистрыСведений.ОбщиеСведения.КонтрагентыСНовымиДанными(ДатаПоследнегоОбновления);

КонецФункции // ()


#КонецОбласти
